/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "พารามิเตอร์ไม่ถูกต้อง";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "รหัสดำเนินการไม่ถูกต้อง";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "ไม่สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ กรุณาตรวจสอบข้อมูลการเข้าสู่ระบบ";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "ผู้ใช้เข้าสู่ระบบแล้ว";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "ระบบกำลังทำการดำเนินการ";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "เนื้อหาการดำเนินการไม่ถูกต้อง";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "ID สำหรับโปรโตคอลการติดต่อสื่อสารไม่ถูกต้อง";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "ID รายการการปฏิบัติไม่ถูกต้อง";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "ไม่สามารถกำหนดโปรโตคอลการติดต่อสื่อสาร";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "ตรวจสอบรหัสผ่านของคุณ";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "อุปกรณ์นี้ถูกลงทะเบียนสำหรับผู้ใช้อื่นแล้ว";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "รหัสผ่านอุปกรณ์ที่คุณป้อนไม่ตรงกัน";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "ไม่อนุญาตให้ดำเนินการในสถานะนี้";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "ข้อมูลการเข้าสู่ระบบที่คุณป้อนไม่เพียงพอหรือไม่ถูกต้อง กรุณาลองอีกครั้ง";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "ไม่สามารถรีเซ็ตแอพ กรุณาตรวจสอบว่าคุณมีการเชื่อมต่อไปยังเครือข่ายหรือไม่";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "ไม่สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ กรุณาตรวจสอบข้อมูลการเข้าสู่ระบบ";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "ตรวจสอบชื่อผู้ใช้และรหัสผ่านของคุณ";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "ไม่สามารถเชื่อมต่อไปยังเซิร์ฟเวอร์ กรุณาติดต่อผู้ดูแลระบบ";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "ข้อมูลการเข้าสู่ระบบที่คุณป้อนไม่เพียงพอหรือไม่ถูกต้อง กรุณาลองอีกครั้ง";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "ป้อนรหัสผ่านอุปกรณ์ที่ถูกต้อง";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "ป้อนรหัสผ่านอุปกรณ์ที่มีตัวเลขอย่างน้อยหนึ่งตัว";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "รหัสผ่านอุปกรณ์ที่คุณป้อนไม่ตรงกัน";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "รหัสผ่านอุปกรณ์หมดอายุแล้ว คุณต้องเปลี่ยนแปลงรหัสผ่าน";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอย่างน้อย {0} อักขระ";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "ป้อนรหัสผ่านที่มีอักขระตัวพิมพ์เล็กอย่างน้อยหนึ่งตัว";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระพิเศษอย่างน้อยหนึ่งตัว";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "ป้อนรหัสผ่านอุปกรณ์ซึ่งมีอักขระที่ไม่ซ้ำกันอย่างน้อย {0} ตัว";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระตัวพิมพ์ใหญ่อย่างน้อยหนึ่งตัว";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "ไม่สามารถดึงคีย์สำหรับใบรับรอง";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "ไม่สามารถดึงใบรับรอง";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "ข้อผิดพลาดที่ไม่รู้จัก";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "มีที่เก็บที่ปลอดภัยอยู่แล้ว";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "ข้อผิดพลาดของประเภทข้อมูล";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "ไม่มีที่เก็บที่ปลอดภัย";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "อาร์กิวเมนต์ไม่ถูกต้อง";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "ป้อนรหัสผ่านที่ถูกต้อง";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "ที่เก็บที่ปลอดภัยถูกล็อค";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "ที่เก็บที่ปลอดภัยมีหน่วยความจำไม่เพียงพอ";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "รหัสผ่านอุปกรณ์หมดอายุแล้ว คุณต้องเปลี่ยนแปลงรหัสผ่าน";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "ป้อนรหัสผ่านอุปกรณ์ซึ่งมีอักขระที่ไม่ซ้ำกันอย่างน้อย {0} ตัว";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "ป้อนรหัสผ่านอุปกรณ์ที่มีตัวเลขอย่างน้อยหนึ่งตัว";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระตัวพิมพ์เล็กอย่างน้อยหนึ่งตัว";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระพิเศษอย่างน้อยหนึ่งตัว";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอักขระตัวพิมพ์ใหญ่อย่างน้อยหนึ่งตัว";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "ป้อนรหัสผ่านอุปกรณ์ที่มีอย่างน้อย {0} อักขระ";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "ป้อนรหัสผ่านอุปกรณ์ซึ่งมีอักขระที่ไม่ซ้ำกันอย่างน้อย {0} ตัว";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "ที่เก็บที่ปลอดภัยถูกลบ";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "การดำเนินการไม่ได้รับการสนับสนุน";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "รหัสผ่าน SSO ไม่ถูกต้อง";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "ข้อมูลประจำตัวสำหรับ Afaria ไม่ถูกต้อง";

